cases/palette/pallet_2x4_no_box/system/battery1/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 270;

    boundaryField
    {
        symmetryPlanePallet
        {
			type            symmetry;
        }
        battery1_to_battery0
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;            
            Tnbr            T;
            thicknessLayers (0.01);
            kappaLayers     (0.05);
            kappaMethod     directionalSolidThermo;
            alphaAni        Anialpha;
            // thermalInertia  true;
            value           uniform 270;
        }
        battery1_to_air
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;            
            Tnbr            T;
            thicknessLayers (0.01);
            kappaLayers     (0.05);
            kappaMethod     directionalSolidThermo;
            alphaAni        Anialpha;
            // thermalInertia  true;
            value           uniform 270;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
		symmetryPlanePallet
        {
			type            symmetry;
        }
    }
}

// ************************************************************************* //
