cases/palette/pallet_2x4_no_box/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        name            symmetryPlanePallet;
        patchInfo
        {
            type            symmetry;
        }
        constructFrom set;
        set symmetryPlanePallet;
    }
    // {
    //     name            test;
    //     patchInfo
    //     {
    //         type            patch;
    //     }
    //     constructFrom set;
    //     set test;
    // }
);

// ************************************************************************* //
